# Question 2

`Write a query to retrieve the top 5 customers who have spent the most amount in the first 6 months of year 2012.`

(Hint: use the HAVING clause to filter out customers who have only made one purchase)

In [1]:
%run ../utils/setup_notebook.ipynb

In [2]:
%%sql 

SELECT *
FROM customers 
LIMIT 1

 * mysql+mysqlconnector://root:***@localhost/sqlite_MediaStore
1 rows affected.

[(1, 'Luís', 'Gonçalves', 'Embraer - Empresa Brasileira de Aeronáutica S.A.', 'Av. Brigadeiro Faria Lima, 2170', 'São José dos Campos', 'SP', 'Brazil', '12227-000', '+55 (12) 3923-5555', '+55 (12) 3923-5566', 'luisg@embraer.com.br', 3)]

In [3]:
%%sql 

SELECT *
FROM invoices
LIMIT 1

 * mysql+mysqlconnector://root:***@localhost/sqlite_MediaStore
1 rows affected.

[(1, 2, '2009-01-01 00:00:00', 'Theodor-Heuss-Straße 34', 'Stuttgart', None, 'Germany', '70174', 1.98)]

In [4]:
%%sql 

SELECT *
FROM invoice_items
LIMIT 1

 * mysql+mysqlconnector://root:***@localhost/sqlite_MediaStore
1 rows affected.

[(1, 1, 2, 0.99, 1)]

In [5]:
%%sql 

SELECT ROUND(SUM(it.UnitPrice * it.Quantity),2) as TotalInvoiceAmount
FROM invoice_items it 
JOIN invoices i ON i.InvoiceId = it.InvoiceId
GROUP BY i.InvoiceId
ORDER BY TotalInvoiceAmount DESC
LIMIT 5

 * mysql+mysqlconnector://root:***@localhost/sqlite_MediaStore
5 rows affected.

[(25.86,), (23.86,), (21.86,), (21.86,), (18.86,)]

In [6]:
%%sql 

SELECT ROUND(SUM(it.UnitPrice * it.Quantity),2) as TotalInvoiceAmount
FROM invoice_items it 
JOIN invoices i ON i.InvoiceId = it.InvoiceId
GROUP BY i.InvoiceId
ORDER BY TotalInvoiceAmount DESC
LIMIT 5

 * mysql+mysqlconnector://root:***@localhost/sqlite_MediaStore
5 rows affected.

[(25.86,), (23.86,), (21.86,), (21.86,), (18.86,)]

In [7]:
%%sql 

SELECT c.CustomerId, c.FirstName, c.LastName, 
COUNT(DISTINCT i.InvoiceId) AS PurchaseCount,
ROUND(SUM(it.UnitPrice * it.Quantity),2) as TotalInvoiceAmount
FROM invoice_items it 
JOIN invoices i ON i.InvoiceId = it.InvoiceId
JOIN customers c ON c.CustomerId = i.CustomerId
GROUP BY i.InvoiceId
ORDER BY TotalInvoiceAmount DESC
LIMIT 5

 * mysql+mysqlconnector://root:***@localhost/sqlite_MediaStore
5 rows affected.

[(6, 'Helena', 'Holý', 1, 25.86),
 (26, 'Richard', 'Cunningham', 1, 23.86),
 (45, 'Ladislav', 'Kovács', 1, 21.86),
 (46, 'Hugh', "O'Reilly", 1, 21.86),
 (25, 'Victor', 'Stevens', 1, 18.86)]